Todo/app/controllers/tasks_controller.rb

    def index
      @tasks = Task.where(status: 'incomplete')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = ?  [["status", "incomplete"]]

    def create
      @task = Task.new(task_params)
      @task.status = 'incomplete'
      if @task.save
---
INSERT INTO "tasks" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "drink"], ["status", "incomplete"], ["created_at", "2024-10-10 14:06:26.082863"], ["updated_at", "2024-10-10 14:06:26.082863"]]

    def complete
      @task = Task.find(params[:id])
      @task.update(status: 'complete')
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "complete"], ["updated_at", "2024-10-10 14:06:27.013287"], ["id", 1]]